<?php

/**
 * 分类测试数据
 */
return [
    ['id' => 1, 'pid' => 0, 'name' => '米面粮油'],
    ['id' => 2, 'pid' => 0, 'name' => '新鲜鲜果'],
    ['id' => 3, 'pid' => 0, 'name' => '绿色蔬菜'],

    ['id' => 11, 'pid' => 1, 'name' => '大米'],
    ['id' => 12, 'pid' => 1, 'name' => '食用油'],
    ['id' => 13, 'pid' => 1, 'name' => '面粉'],
    ['id' => 14, 'pid' => 1, 'name' => '面条'],
    ['id' => 15, 'pid' => 1, 'name' => '杂粮'],

    ['id' => 21, 'pid' => 2, 'name' => '浆果类'],
    ['id' => 22, 'pid' => 2, 'name' => '柑橘类'],
    ['id' => 23, 'pid' => 2, 'name' => '核果类'],
    ['id' => 24, 'pid' => 2, 'name' => '仁果类'],
    ['id' => 25, 'pid' => 2, 'name' => '瓜类'],

    ['id' => 31, 'pid' => 3, 'name' => '叶菜类'],
    ['id' => 32, 'pid' => 3, 'name' => '根茎类'],
    ['id' => 33, 'pid' => 3, 'name' => '茄果类'],
    ['id' => 34, 'pid' => 3, 'name' => '菌类'],
    ['id' => 35, 'pid' => 3, 'name' => '鲜豆类'],
];
